ХМНПФ_Общее/InformationRegisters/ХМ_Кейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_Кейсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>RM_Задача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ХМ_Кейсы/Forms/ФормаУстановкиКейсов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РежимУточнения") Тогда 
		РежимУточнения = Истина;
    	Элементы.НомерСчета.Видимость = Ложь;
 	КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если РежимУточнения = Истина Тогда        
		ТребуемоеУточнение =  Новый Структура();
		ТребуемоеУточнение.Вставить("RM_Задача",Запись.RM_Задача);
		ТребуемоеУточнение.Вставить("Описание",Запись.Описание);
		ТребуемоеУточнение.Вставить("Документ",Запись.Документ);
		ЭтаФорма.Закрыть(ТребуемоеУточнение);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	Если РежимУточнения = Истина Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуИзНавигационной(НС)
    
    ПерваяТочка = Найти(НС, "e1cib/data/");
    ВтораяТочка = Найти(НС, "?ref=");
    
    ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
    Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
    
КонецФункции

&НаКлиенте
Процедура НавигационнаяСсылкаПриИзменении(Элемент)
	Запись.Документ = ПолучитьСсылкуИзНавигационной(НавСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.Документ) Тогда
		НавСсылка = ПолучитьНавигационнуюСсылку(Запись.Документ); 
	Иначе
		НавСсылка = ""; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура RM_ЗадачаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Описание) ИЛИ НЕ ЗначениеЗаполнено(Запись.RM_Задача) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХМ_Кейсы.Описание КАК Описание
		|ИЗ
		|	РегистрСведений.ХМ_Кейсы КАК ХМ_Кейсы
		|ГДЕ
		|	ХМ_Кейсы.RM_Задача = &RM_Задача";
	
	Запрос.УстановитьПараметр("RM_Задача", Запись.RM_Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Запись.Описание = ВыборкаДетальныеЗаписи.Описание;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RM_ЗадачаПриИзменении(Элемент)
	RM_ЗадачаПриИзмененииНаСервере();
КонецПроцедуры
